/************************************************************************/
/*
创建日期:	2006年2月13日
创建时间:	11:54
文件名称:	PlayerShopPool.h
文件路径:	d:\Prj\Server\Server\Other\PlayerShopPool.h

文件功能：	玩家商店池
修改纪录：
*/
/************************************************************************/

#ifndef _PLAYER_SHOP_POOL_H__
#define _PLAYER_SHOP_POOL_H__

#include "PlayerShopDefine.h"
#include "PlayerShop.h"


class SceneManager;
/*
*PlayerShopPool	池类
*/
class PlayerShopPool
{
public:
	PlayerShopPool();
	~PlayerShopPool();
public:
	//-------------------------------------------------------------------------------------------------
	//初始化,清空玩家商店
	BOOL Init(UINT nPoolSize);

	VOID CleanUp();

public:
	//-------------------------------------------------------------------------------------------------
	//池大小
	UINT			GetPoolSize(){return m_PoolSize;}
	VOID			SetPoolSize(UINT uPoolSize){m_PoolSize = uPoolSize;}
	//-------------------------------------------------------------------------------------------------
	//从池中新建一个玩家商店
	PlayerShop*		NewPlayerShop(ID_t idScene);
	//-------------------------------------------------------------------------------------------------
	//根据索引回收一个玩家商店
	VOID			DelPlayerShop(UINT uShopPos);
	//-------------------------------------------------------------------------------------------------
	//根据商店指针回收一个玩家商店
	VOID			DeleteObj(PlayerShop* pPlayerShop);
	//-------------------------------------------------------------------------------------------------
	//根据池的内容，把每个商店连接到指定的商店管理器中
	BOOL			ConnectTo(SceneManager*	pSceneManager);

private:
	//-------------------------------------------------------------------------------------------------
	//PlayerShop数组
	PlayerShop*		m_pPlayerShop;
	//-------------------------------------------------------------------------------------------------
	//空闲PlayerShop池Id
	UINT*			m_pFreeItemID;
	//-------------------------------------------------------------------------------------------------
	//空闲位置标记
	UINT			m_nFreePosition;
	//-------------------------------------------------------------------------------------------------
	//共享锁
	MyLock			m_Lock;
	//-------------------------------------------------------------------------------------------------
	//池的大小
	UINT			m_PoolSize;
	//-------------------------------------------------------------------------------------------------
	//世界ID
	ID_t			m_WorldId;
	//-------------------------------------------------------------------------------------------------
	//服务器ID
	ID_t			m_ServerId;
};


extern PlayerShopPool	*g_pPlayerShopPool;

#endif	// _PLAYER_SHOP_POOL_H__
