/************************************************************************/
/*
创建日期:	2006年2月13日
创建时间:	11:54
文件名称:	PlayerShop.h
文件路径:	d:\Prj\Server\Server\Other\PlayerShopManager.h

文件功能：	玩家商店管理器,挂在每个场景上，管理这个场景中所有的玩家商店。
修改纪录：
*/
/************************************************************************/
#ifndef	_PLAYER_SHOP_MANAGER_H_
#define	_PLAYER_SHOP_MANAGER_H_

#include "PlayerShop.h"
class Scene;
/*
玩家商店管理器
*/

class PlayerShopManager
{
public:
	PlayerShopManager()
	{
		m_nPlayerShopNum= 0;
		m_pScene		= 0;
	};
	~PlayerShopManager()
	{

	};
public:
	//-------------------------------------------------------------------------------------------------
	//初始化,清空玩家商店
	VOID Init(Scene* pScene);

	VOID CleanUp();

public:
	//-------------------------------------------------------------------------------------------------
	//新建一个玩家商店，并自动加到商店管理器中
	INT			NewPlayerShop();
	//-------------------------------------------------------------------------------------------------
	//加一个已有的玩家商店到商店管理器
	INT			AddPlayerShop(PlayerShop* pPlayerShop);
	//-------------------------------------------------------------------------------------------------
	//在商店管理器中，删除一个商店
	BOOL		RemovePlayerShop(INT iShopIndex);
	//-------------------------------------------------------------------------------------------------
	//在商店管理器中，根据GUID删除一个商店
	BOOL		RemovePlayerShopByGuid(_PLAYERSHOP_GUID ShopGuid);

	//-------------------------------------------------------------------------------------------------
	//此管理器中玩家商店的个数
	UINT		GetPlayerShopNum(){return m_nPlayerShopNum;}
	//-------------------------------------------------------------------------------------------------
	//根据索引获得一个玩家商店
	PlayerShop*	GetPlayerShopByIndex(INT iShopIndex);
	//-------------------------------------------------------------------------------------------------
	//根据GUID获得一个玩家商店
	PlayerShop*	GetPlayerShopByGUID(_PLAYERSHOP_GUID ShopGuid);
	//-------------------------------------------------------------------------------------------------
	//心跳
	BOOL		HeartBeat(UINT uTime);
	//-------------------------------------------------------------------------------------------------
	//商指操作
	VOID		ClampComFactor();
	FLOAT		GetComFactor(){ return m_CommerceFactor; }
	VOID		SetComFactor(FLOAT fComFactor){ m_CommerceFactor = fComFactor; }
private:
	//-------------------------------------------------------------------------------------------------
	//刷新商指
	FLOAT		UpdateComFactor();
private:
	//-------------------------------------------------------------------------------------------------
	//此场景玩家商店列表
	PlayerShop*		m_pPlayerShopList[MAX_SHOP_NUM_PER_SCENE];		//此场景玩家商店列表
	//-------------------------------------------------------------------------------------------------
	//当前场景玩家商店的个数
	UINT			m_nPlayerShopNum;								
	//-------------------------------------------------------------------------------------------------
	//场景指针
	Scene*			m_pScene;	
	//-------------------------------------------------------------------------------------------------
	//空闲PlayerShop池Id
	UINT			m_pFreeItemID[MAX_SHOP_NUM_PER_SCENE];
	//-------------------------------------------------------------------------------------------------
	//传说中的商业指数
	FLOAT			m_CommerceFactor;
};

#endif

